import React from 'react'

function SleepCheckSheetPage() {
  return (
    <>
    <div>SleepCheckSheetPage</div>
    <form>
        <h3>睡眠状態</h3>
    <ul>
        <li>昼間に強い眠気を感じる</li>
        <li>日中、いつでもどこでもすぐに眠れる</li>
        <li>休日に長時間眠って、平日よりも2時間以上寝だめをしている</li>
        <li>睡眠時間や、就寝時刻・起床時間がばらばら</li>
        <li>寝つきが悪い・夜中や早朝に何度も目が覚める・熟睡感や休養感がない</li>
        <li>いびきを人に指摘されたことがある</li>
        <li>夜中に3回以上トイレに起きる</li>
        <li>起きると口の中やのどが乾燥している</li>
    </ul>
    <h3>寝室の環境</h3>
    <ul>
        <li>寝る前も寝た後も部屋が明るい</li>
        <li>寝るときに周りの音や人の声が気になる</li>
        <li>暑さや寒さで寝苦しいことがある</li>
        <li>起きた時に首や肩、腰などが痛い</li>
        <li>パートナー・子供・ペットと同じベッドや寝具で寝ている</li>
    </ul>
    <h3>入眠前後の習慣</h3>
    <ul>
        <li>夜の自宅リビングやダイニングが、明るい</li>
        <li>夕方または夜に自宅で寝落ちの習慣がある</li>
        <li>就寝前にゲーム・SNS・ショート動画を見る</li>
        <li>就寝前に仕事や悩み事について考え続け、ストレスを感じている</li>
        <li>寝酒をする</li>
        <li>夕方以降にカフェインを摂っている</li>
        <li>寝れないときは布団の中でじっと過ごしている</li>
    </ul>
    </form>
    </>
  )
}

export default SleepCheckSheetPage